<a href="https://colab.research.google.com/github/19PA1A0548/Ai/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# importing required libraries
import pandas as pd
import numpy as np

In [ ]:
#Series

In [ ]:
df1 = pd.Series([1,2,3],index=["a","b","c"]) #defining series
df1

a    1
b    2
c    3
dtype: int64

In [ ]:
a = np.array([1,2,3,4]) #another way of defining series
b = pd.Series(a)
print(b)

0    1
1    2
2    3
3    4
dtype: int64

In [ ]:
a1 = {1:"a",2:"b"}
b1 = pd.Series(a)
b1

1    a
2    b
dtype: object

In [ ]:
print(pd.Series(5,index=[1,2,3]))

1    5
2    5
3    5
dtype: int64

In [ ]:
print(b[1])

a

In [ ]:
#DataFrame

In [ ]:
# creating a dataframe
df = pd.DataFrame([
                   ["Zuken",10,22],
                   ["Elon",11,23],
                   ["Bill",12,24],
                   ["larry",13,25],
                   ["sundar",14,26]],columns=["Name","number","age"])
df

     Name  number  age
0   Zuken      10   22
1    Elon      11   23
2    Bill      12   24
3   larry      13   25
4  sundar      14   26

In [ ]:
#another way of creating dataframe
df = pd.DataFrame({
    "Name":["Zuken","Elon","Bill","Larry","Sundar"],
    "number":[10,11,12,13,14],
    "age":[22,23,24,25,26]
})
df

     Name  number  age
0   Zuken      10   22
1    Elon      11   23
2    Bill      12   24
3   Larry      13   25
4  Sundar      14   26

In [ ]:
df["marks"]=pd.Series([1,1,1,1,1])# how to add columns to dataframe
df

     Name  number  age  marks
0   Zuken      10   22      1
1    Elon      11   23      1
2    Bill      12   24      1
3   Larry      13   25      1
4  Sundar      14   26      1

In [ ]:
# adding rows to dataframe
df1 = pd.DataFrame({
    "Name":["abhi"],
    "number":[15],
    "age":[27],
    "marks":[1]
},index=[5])
df = df.append(df1)
df.drop(5)# deleting row
del df["marks"]#deleting columns
df

     Name  number  age
0   Zuken      10   22
1    Elon      11   23
2    Bill      12   24
3   Larry      13   25
4  Sundar      14   26
5    abhi      15   27
0    abhi      15   27
5    abhi      15   27
5    abhi      15   27
5    abhi      15   27
5    abhi      15   27
5    abhi      15   27
5    abhi      15   27

In [ ]:
df.T

            0     1     2      3       4  ...     5     5     5     5     5
Name    Zuken  Elon  Bill  Larry  Sundar  ...  abhi  abhi  abhi  abhi  abhi
number     10    11    12     13      14  ...    15    15    15    15    15
age        22    23    24     25      26  ...    27    27    27    27    27

[3 rows x 13 columns]

In [ ]:
df = df.drop(5)

In [ ]:
df

     Name  number  age
0   Zuken      10   22
1    Elon      11   23
2    Bill      12   24
3   Larry      13   25
4  Sundar      14   26
0    abhi      15   27

In [ ]:
df.shape
df.size

18

In [ ]:
df.head(2)
df.tail(2)

     Name  number  age
4  Sundar      14   26
0    abhi      15   27

In [ ]:
df.sum()

Name      ZukenElonBillLarrySundarabhi
number                              75
age                                147
dtype: object

In [ ]:
df["age"].sum()

147

In [ ]:
df.describe(include="all")

        Name     number        age
count      6   6.000000   6.000000
unique     6        NaN        NaN
top     Bill        NaN        NaN
freq       1        NaN        NaN
mean     NaN  12.500000  24.500000
std      NaN   1.870829   1.870829
min      NaN  10.000000  22.000000
25%      NaN  11.250000  23.250000
50%      NaN  12.500000  24.500000
75%      NaN  13.750000  25.750000
max      NaN  15.000000  27.000000

In [ ]:
#applying functions
def fun(x):
  return x**2

df["age"].apply(fun)

0    484
1    529
2    576
3    625
4    676
0    729
Name: age, dtype: int64

In [ ]:
df = df.rename(columns={"age":"Age","number":"Number"})
df

     Name  Number  Age
0   Zuken      10   22
1    Elon      11   23
2    Bill      12   24
3   Larry      13   25
4  Sundar      14   26
0    abhi      15   27

In [ ]:
for i,j in df.iterrows():#iterating through dataframe
  print(j)

Name      Zuken
Number       10
Age          22
Name: 0, dtype: object
Name      Elon
Number      11
Age         23
Name: 1, dtype: object
Name      Bill
Number      12
Age         24
Name: 2, dtype: object
Name      Larry
Number       13
Age          25
Name: 3, dtype: object
Name      Sundar
Number        14
Age           26
Name: 4, dtype: object
Name      abhi
Number      15
Age         27
Name: 0, dtype: object

In [ ]:
df = pd.read_csv("/content/Iris.csv")
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [ ]:
df.isna().sum()

Id               0
SepalLengthCm    0
SepalWidthCm     0
PetalLengthCm    0
PetalWidthCm     0
Species          0
dtype: int64

In [ ]:
df.dropna()

      Id  SepalLengthCm  ...  PetalWidthCm         Species
0      1            5.1  ...           0.2     Iris-setosa
1      2            4.9  ...           0.2     Iris-setosa
2      3            4.7  ...           0.2     Iris-setosa
3      4            4.6  ...           0.2     Iris-setosa
4      5            5.0  ...           0.2     Iris-setosa
..   ...            ...  ...           ...             ...
145  146            6.7  ...           2.3  Iris-virginica
146  147            6.3  ...           1.9  Iris-virginica
147  148            6.5  ...           2.0  Iris-virginica
148  149            6.2  ...           2.3  Iris-virginica
149  150            5.9  ...           1.8  Iris-virginica

[150 rows x 6 columns]

In [ ]:
df.fillna(0)

      Id  SepalLengthCm  ...  PetalWidthCm         Species
0      1            5.1  ...           0.2     Iris-setosa
1      2            4.9  ...           0.2     Iris-setosa
2      3            4.7  ...           0.2     Iris-setosa
3      4            4.6  ...           0.2     Iris-setosa
4      5            5.0  ...           0.2     Iris-setosa
..   ...            ...  ...           ...             ...
145  146            6.7  ...           2.3  Iris-virginica
146  147            6.3  ...           1.9  Iris-virginica
147  148            6.5  ...           2.0  Iris-virginica
148  149            6.2  ...           2.3  Iris-virginica
149  150            5.9  ...           1.8  Iris-virginica

[150 rows x 6 columns]

In [ ]:
df.groupby(by="Species").groups

{'Iris-setosa': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49], 'Iris-versicolor': [50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99], 'Iris-virginica': [100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149]}

In [ ]:
df.groupby(by=["Species","PetalWidthCm"]).groups

{('Iris-setosa', 0.1): [9, 12, 13, 32, 34, 37], ('Iris-setosa', 0.2): [0, 1, 2, 3, 4, 7, 8, 10, 11, 14, 20, 22, 24, 25, 27, 28, 29, 30, 33, 35, 36, 38, 39, 42, 46, 47, 48, 49], ('Iris-setosa', 0.3): [6, 17, 18, 19, 40, 41, 45], ('Iris-setosa', 0.4): [5, 15, 16, 21, 26, 31, 44], ('Iris-setosa', 0.5): [23], ('Iris-setosa', 0.6): [43], ('Iris-versicolor', 1.0): [57, 60, 62, 67, 79, 81, 93], ('Iris-versicolor', 1.1): [69, 80, 98], ('Iris-versicolor', 1.2): [73, 82, 90, 92, 95], ('Iris-versicolor', 1.3): [53, 55, 58, 64, 71, 74, 87, 88, 89, 94, 96, 97, 99], ('Iris-versicolor', 1.4): [50, 59, 63, 65, 75, 76, 91], ('Iris-versicolor', 1.5): [51, 52, 54, 61, 66, 68, 72, 78, 84, 86], ('Iris-versicolor', 1.6): [56, 83, 85], ('Iris-versicolor', 1.7): [77], ('Iris-versicolor', 1.8): [70], ('Iris-virginica', 1.4): [134], ('Iris-virginica', 1.5): [119, 133], ('Iris-virginica', 1.6): [129], ('Iris-virginica', 1.7): [106], ('Iris-virginica', 1.8): [103, 107, 108, 116, 123, 125, 126, 127, 137, 138, 149], ('Iris-virginica', 1.9): [101, 111, 130, 142, 146], ('Iris-virginica', 2.0): [110, 113, 121, 122, 131, 147], ('Iris-virginica', 2.1): [102, 105, 112, 124, 128, 139], ('Iris-virginica', 2.2): [104, 117, 132], ('Iris-virginica', 2.3): [115, 118, 120, 135, 141, 143, 145, 148], ('Iris-virginica', 2.4): [114, 136, 140], ('Iris-virginica', 2.5): [100, 109, 144]}

In [ ]:
g = df.groupby(by="Species")

In [ ]:
grou = df.groupby("Species")
grou.get_group("Iris-setosa").head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [ ]:
df.groupby(by="Species").filter(lambda x:len(x)>49)

      Id  SepalLengthCm  ...  PetalWidthCm         Species
0      1            5.1  ...           0.2     Iris-setosa
1      2            4.9  ...           0.2     Iris-setosa
2      3            4.7  ...           0.2     Iris-setosa
3      4            4.6  ...           0.2     Iris-setosa
4      5            5.0  ...           0.2     Iris-setosa
..   ...            ...  ...           ...             ...
145  146            6.7  ...           2.3  Iris-virginica
146  147            6.3  ...           1.9  Iris-virginica
147  148            6.5  ...           2.0  Iris-virginica
148  149            6.2  ...           2.3  Iris-virginica
149  150            5.9  ...           1.8  Iris-virginica

[150 rows x 6 columns]

In [ ]:
df.dtypes

Id                 int64
SepalLengthCm    float64
SepalWidthCm     float64
PetalLengthCm    float64
PetalWidthCm     float64
Species           object
dtype: object

In [ ]:
x = df["SepalLengthCm"].max()
y = df[df["SepalLengthCm"]==x]
y["Species"]

131    Iris-virginica
Name: Species, dtype: object

In [ ]:
zz = df["SepalLengthCm"].min()
zz

4.3

In [ ]:
df1 = pd.read_csv("/content/movie_metadata.csv")
df1.head()

   color      director_name  ...  aspect_ratio  movie_facebook_likes
0  Color      James Cameron  ...          1.78                 33000
1  Color     Gore Verbinski  ...          2.35                     0
2  Color         Sam Mendes  ...          2.35                 85000
3  Color  Christopher Nolan  ...          2.35                164000
4    NaN        Doug Walker  ...           NaN                     0

[5 rows x 28 columns]

In [ ]:
del df1["movie_facebook_likes"]

In [ ]:
df1.head()

       director_name  num_critic_for_reviews  ...  title_year imdb_score
0      James Cameron                   723.0  ...      2009.0        7.9
1     Gore Verbinski                   302.0  ...      2007.0        7.1
2         Sam Mendes                   602.0  ...      2015.0        6.8
3  Christopher Nolan                   813.0  ...      2012.0        8.5
4        Doug Walker                     NaN  ...         NaN        7.1

[5 rows x 19 columns]

In [ ]:
df1 = df1.dropna()

In [ ]:
df1.head()

       director_name  duration  ...  title_year imdb_score
0      James Cameron     178.0  ...      2009.0        7.9
1     Gore Verbinski     169.0  ...      2007.0        7.1
2         Sam Mendes     148.0  ...      2015.0        6.8
3  Christopher Nolan     164.0  ...      2012.0        8.5
5     Andrew Stanton     132.0  ...      2012.0        6.6

[5 rows x 9 columns]

In [ ]:
r = df1[df1["imdb_score"]>8]
r["movie_title"].head()

3          The Dark Knight Rises
17                  The Avengers
27    Captain America: Civil War
43                   Toy Story 3
58                        WALLE
Name: movie_title, dtype: object

In [ ]:
pro = pd.DataFrame()
pro["budget"] = df1["budget"]
pro["gross"] = df1["gross"]

In [ ]:
ma = 0
for i,j in pro.iterrows():
  x = j["gross"]-j["budget"]
  if x>ma:
    ma = x
print(ma)

523505847.0

In [ ]:
mo=""
max1=0
for i,j in df1.iterrows():
  y = j["gross"]-j["budget"]
  if y>max1:
    max1=y
    mo=j["movie_title"]
df1[df1["movie_title"]==mo]

   director_name  duration        gross  ...       budget title_year imdb_score
0  James Cameron     178.0  760505847.0  ...  237000000.0     2009.0        7.9

[1 rows x 9 columns]

In [ ]:
var = df1["budget"].idxmax()
df1.loc[[var]]

     director_name  duration      gross  ...        budget title_year imdb_score
2988  Joon-ho Bong     110.0  2201412.0  ...  1.221550e+10     2006.0        7.0

[1 rows x 9 columns]

In [ ]:
df1.sort_values(by="budget",ascending=True).head()

          director_name  duration      gross  ...  budget title_year imdb_score
4799  Jonathan Caouette      88.0   592014.0  ...   218.0     2003.0        7.2
5042           Jon Gunn      90.0    85222.0  ...  1100.0     2004.0        6.6
5026    Olivier Assayas     110.0   136007.0  ...  4500.0     2004.0        6.9
5035   Robert Rodriguez      81.0  2040920.0  ...  7000.0     1992.0        6.9
5034   Neill Dela Llana      80.0    70071.0  ...  7000.0     2005.0        6.3

[5 rows x 9 columns]

In [ ]:
hi = df1["budget"].idxmin()
df1.drop(hi)

          director_name  duration  ...  title_year imdb_score
0         James Cameron     178.0  ...      2009.0        7.9
1        Gore Verbinski     169.0  ...      2007.0        7.1
2            Sam Mendes     148.0  ...      2015.0        6.8
3     Christopher Nolan     164.0  ...      2012.0        8.5
5        Andrew Stanton     132.0  ...      2012.0        6.6
...                 ...       ...  ...         ...        ...
5033      Shane Carruth      77.0  ...      2004.0        7.0
5034   Neill Dela Llana      80.0  ...      2005.0        6.3
5035   Robert Rodriguez      81.0  ...      1992.0        6.9
5037       Edward Burns      95.0  ...      2011.0        6.4
5042           Jon Gunn      90.0  ...      2004.0        6.6

[3886 rows x 9 columns]

In [ ]:
he = df1["budget"].idxmin()
df1.loc[[he]]

          director_name  duration     gross  ... budget title_year imdb_score
4799  Jonathan Caouette      88.0  592014.0  ...  218.0     2003.0        7.2

[1 rows x 9 columns]

In [ ]:
df1[df1["budget"]==237000000.0]

   director_name  duration        gross  ...       budget title_year imdb_score
0  James Cameron     178.0  760505847.0  ...  237000000.0     2009.0        7.9

[1 rows x 9 columns]